dataframe에서 원소/요소 데이터 변경

In [2]:
#모듈 로딩
import pandas as pd

In [3]:
#데이터 준비
data={'name':['홍길동','마징가','원더우먼'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100,200,300],
      'height':[180,300,200]}

In [4]:
#df로 데이터 저장
datadf=pd.DataFrame(data)
datadf

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

원소/요소 값 변경

In [6]:
#홍길동의 성별 정보 추출
datadf.loc[0]['gender']

'남'

In [8]:
datadf.iloc[0,2]

'남'

In [10]:
#홍길동 성별 남->여
datadf.iloc[0,2]='여'

In [11]:
datadf

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [12]:
#원더우먼 직업 영웅->직장인
datadf.iloc[2,1]='직장인'
datadf

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우먼  직장인      여  300     200

행 전체 값 변경

In [13]:
#행 전체 선택: 변수명.iloc[]/변수명.loc[]
#행 추출
datadf.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [14]:
#1번 행 값 변경: 컬럼 개수==데이터 개수
datadf.iloc[1]=['마징가2','영웅','여',90,170]
datadf

   name  job gender  age  height
0   홍길동   의적      여  100     180
1  마징가2   영웅      여   90     170
2  원더우먼  직장인      여  300     200

In [15]:
#1번 행 값 변경: 데이터 개수 1개
datadf.iloc[1]=0
datadf

   name  job gender  age  height
0   홍길동   의적      여  100     180
1     0    0      0    0       0
2  원더우먼  직장인      여  300     200

In [16]:
#열 값 변경
datadf.height=0
datadf

   name  job gender  age  height
0   홍길동   의적      여  100       0
1     0    0      0    0       0
2  원더우먼  직장인      여  300       0